title: Suspicious Creation Of Phantom DLLs (Hexacorn List)
id: bbe4334b-5f43-452a-b3d0-98ac76baa962 
status: experimental
description: |
  Hexacorn's phantomdlls.txt list detection. Presence of files may indicate dll sideloading or other bad shenanigans.
  AI was used in the creation of this rule. User discretion is advised.
author: selogreen
date: 2025/12/02
references:
  - https://www.hexacorn.com/blog/2025/11/29/more-hidden-phantom-dlls/
  - https://hexacorn.com/d/phantomdlls.txt
tags:
  - attack.defense_evasion
  - attack.t1574.002
  - attack.t1574.001
logsource:
  product: windows
  category: file_event

detection:
  sysmon_file_create:
    EventID: 11
    TargetFilename|endswith:
      - '\AppReadiness.dll,PreinstalledVolumeServicing.dll'
      - '\AppXDeploymentServer.dll,UdiApi.dll'
      - '\CloudExperienceHostCommon.dll,debugregsvcapi.dll'
      - '\D3D12.dll,DXCaptureReplay.dll'
      - '\DeveloperOptionsSettingsHandlers.dll,debugregsvcapi.dll'
      - '\DeviceDirectoryClient.dll,phoneinfo.dll'
      - '\DeviceEnroller.exe,ShellChromeAPI.dll'
      - '\EdgeContent.dll,wpaxholder.dll'
      - '\EnterpriseAppMgmtSvc.dll,ChamberProf.Dll'
      - '\EnterpriseAppMgmtSvc.dll,DeploymentExt.dll'
      - '\EnterpriseAppMgmtSvc.dll,WPTrust.dll'
      - '\EnterpriseAppMgmtSvc.dll,PreAuthz.dll'
      - '\EnterpriseAppMgmtSvc.dll,EmClient.dll'
      - '\EnterpriseAppMgmtSvc.dll,EmSvcs.dll'
      - '\EnterpriseAppMgmtSvc.dll,EnterprisePhoneExt.dll'
      - '\EnterpriseAppMgmtSvc.dll,btscli.dll'
      - '\EnterpriseAppMgmtSvc.dll,wpcoreutil.dll'
      - '\FlightSettings.dll,FveEnableUnlock.dll'
      - '\IKEEXT.DLL,wlbsctrl.dll'
      - '\InputService.dll,FakeCWClient.dll'
      - '\InputService.dll,UT_FakeCWClient.dll'
      - '\Microsoft.Uev.Office2013CustomActions.dll,OLMAPI32.dll'
      - '\ResetEngine.dll,wpeutil.dll'
      - '\ResetEngine.dll,SetupPlatform.dll'
      - '\ResetEngine.dll,fbwflib.dll'
      - '\SensorsNativeApi.dll,WpSensorsNativeApi.V1.dll'
      - '\StorSvc.dll,ShellChromeAPI.dll'
      - '\SystemSettings.DataModel.dll,SettingsEnvironment.dll'
      - '\SystemSettingsAdminFlows.exe,debugregsvcapi.dll'
      - '\SystemSettingsThresholdAdminFlowUI.dll,debugregsvcapi.dll'
      - '\UpdateAgent.dll,ReserveManager.dll'
      - '\appsruprov.dll,EmSvcs.dll'
      - '\cdp.dll,cdpsgshims.dll'
      - '\cdpsvc.dll,cdpsgshims.dll'
      - '\certutil.exe,certadm.dll'
      - '\cewmdm.dll,CEUTIL.DLL'
      - '\conhost.exe,ConhostV1.dll'
      - '\d2d1.dll,DXCaptureReplay.dll'
      - '\d3d10.dll,d3d10d.dll'
      - '\d3d10.dll,DXCaptureReplay.dll'
      - '\d3d10_1.dll,DXCaptureReplay.dll'
      - '\d3d10_1.dll,D3D10_1d.dll'
      - '\d3d11.dll,DXCaptureReplay.dll'
      - '\d3d9on12.dll,D3D9on12ShaderValidator.dll'
      - '\dcntel.dll,minuser.dll'
      - '\dcntel.dll,XboxLiveTitleId.dll'
      - '\diagtrack.dll,XboxLiveTitleId.dll'
      - '\dmcmnutils.dll,wpcoreutil.dll'
      - '\dmenrollengine.dll,SecRuntime.dll'
      - '\dmenrollengine.dll,phoneinfo.dll'
      - '\dxgi.dll,DXCaptureReplay.dll'
      - '\generaltel.dll,centel.dll'
      - '\jscript9.dll,jsIntl.dll'
      - '\jscript9Legacy.dll,jsIntl.dll'
      - '\mdmregistration.dll,phoneinfo.dll'
      - '\mispace.dll,healthapi.dll'
      - '\mprddm.dll,ipbootp.dll'
      - '\msiexec.exe,ISMIF32.DLL'
      - '\netprofmsvc.dll,XboxNetApiSvcExtHost.dll'
      - '\ole32.dll,olecnv32.dll'
      - '\prntvpt.dll,PrintCoreConfig.dll'
      - '\rpcrt4.dll,RpcShim.dll'
      - '\spoolsv.exe,ualapi.dll'
      - '\spoolsvworker.exe,ualapi.dll'
      - '\tellib.dll,XboxLiveTitleId.dll'
      - '\upnphost.dll,upnphost.dll.mui'
      - '\usermgr.dll,LegacyUserManager.dll'
      - '\wer.dll,phoneinfo.dll'
      - '\wer.dll,XboxLiveTitleId.dll'
      - '\wermgr.exe,offdmpsvc.dll'
      - '\wininet.dll,wininetxblext.dll'
      - '\wpr.exe,axeonoffhelper.dll'
      - '\wsp_fs.dll,healthapi.dll'
      - '\wsp_health.dll,healthapi.dll'

  security_file_create:
    EventID: 4663
    Accesses|contains: 'WriteData'    # or 'CreateFile' depending on your mapping
    ObjectType: 'File'
    ObjectName|endswith:
      - '\AppReadiness.dll,PreinstalledVolumeServicing.dll'
      - '\AppXDeploymentServer.dll,UdiApi.dll'
      - '\CloudExperienceHostCommon.dll,debugregsvcapi.dll'
      - '\D3D12.dll,DXCaptureReplay.dll'
      - '\DeveloperOptionsSettingsHandlers.dll,debugregsvcapi.dll'
      - '\DeviceDirectoryClient.dll,phoneinfo.dll'
      - '\DeviceEnroller.exe,ShellChromeAPI.dll'
      - '\EdgeContent.dll,wpaxholder.dll'
      - '\EnterpriseAppMgmtSvc.dll,ChamberProf.Dll'
      - '\EnterpriseAppMgmtSvc.dll,DeploymentExt.dll'
      - '\EnterpriseAppMgmtSvc.dll,WPTrust.dll'
      - '\EnterpriseAppMgmtSvc.dll,PreAuthz.dll'
      - '\EnterpriseAppMgmtSvc.dll,EmClient.dll'
      - '\EnterpriseAppMgmtSvc.dll,EmSvcs.dll'
      - '\EnterpriseAppMgmtSvc.dll,EnterprisePhoneExt.dll'
      - '\EnterpriseAppMgmtSvc.dll,btscli.dll'
      - '\EnterpriseAppMgmtSvc.dll,wpcoreutil.dll'
      - '\FlightSettings.dll,FveEnableUnlock.dll'
      - '\IKEEXT.DLL,wlbsctrl.dll'
      - '\InputService.dll,FakeCWClient.dll'
      - '\InputService.dll,UT_FakeCWClient.dll'
      - '\Microsoft.Uev.Office2013CustomActions.dll,OLMAPI32.dll'
      - '\ResetEngine.dll,wpeutil.dll'
      - '\ResetEngine.dll,SetupPlatform.dll'
      - '\ResetEngine.dll,fbwflib.dll'
      - '\SensorsNativeApi.dll,WpSensorsNativeApi.V1.dll'
      - '\StorSvc.dll,ShellChromeAPI.dll'
      - '\SystemSettings.DataModel.dll,SettingsEnvironment.dll'
      - '\SystemSettingsAdminFlows.exe,debugregsvcapi.dll'
      - '\SystemSettingsThresholdAdminFlowUI.dll,debugregsvcapi.dll'
      - '\UpdateAgent.dll,ReserveManager.dll'
      - '\appsruprov.dll,EmSvcs.dll'
      - '\cdp.dll,cdpsgshims.dll'
      - '\cdpsvc.dll,cdpsgshims.dll'
      - '\certutil.exe,certadm.dll'
      - '\cewmdm.dll,CEUTIL.DLL'
      - '\conhost.exe,ConhostV1.dll'
      - '\d2d1.dll,DXCaptureReplay.dll'
      - '\d3d10.dll,d3d10d.dll'
      - '\d3d10.dll,DXCaptureReplay.dll'
      - '\d3d10_1.dll,DXCaptureReplay.dll'
      - '\d3d10_1.dll,D3D10_1d.dll'
      - '\d3d11.dll,DXCaptureReplay.dll'
      - '\d3d9on12.dll,D3D9on12ShaderValidator.dll'
      - '\dcntel.dll,minuser.dll'
      - '\dcntel.dll,XboxLiveTitleId.dll'
      - '\diagtrack.dll,XboxLiveTitleId.dll'
      - '\dmcmnutils.dll,wpcoreutil.dll'
      - '\dmenrollengine.dll,SecRuntime.dll'
      - '\dmenrollengine.dll,phoneinfo.dll'
      - '\dxgi.dll,DXCaptureReplay.dll'
      - '\generaltel.dll,centel.dll'
      - '\jscript9.dll,jsIntl.dll'
      - '\jscript9Legacy.dll,jsIntl.dll'
      - '\mdmregistration.dll,phoneinfo.dll'
      - '\mispace.dll,healthapi.dll'
      - '\mprddm.dll,ipbootp.dll'
      - '\msiexec.exe,ISMIF32.DLL'
      - '\netprofmsvc.dll,XboxNetApiSvcExtHost.dll'
      - '\ole32.dll,olecnv32.dll'
      - '\prntvpt.dll,PrintCoreConfig.dll'
      - '\rpcrt4.dll,RpcShim.dll'
      - '\spoolsv.exe,ualapi.dll'
      - '\spoolsvworker.exe,ualapi.dll'
      - '\tellib.dll,XboxLiveTitleId.dll'
      - '\upnphost.dll,upnphost.dll.mui'
      - '\usermgr.dll,LegacyUserManager.dll'
      - '\wer.dll,phoneinfo.dll'
      - '\wer.dll,XboxLiveTitleId.dll'
      - '\wermgr.exe,offdmpsvc.dll'
      - '\wininet.dll,wininetxblext.dll'
      - '\wpr.exe,axeonoffhelper.dll'
      - '\wsp_fs.dll,healthapi.dll'
      - '\wsp_health.dll,healthapi.dll'

  condition: sysmon_file_create or security_file_create

fields:
  - Image
  - ProcessGuid
  - ProcessId
  - User
  - TargetFilename
  - ObjectName
  - CommandLine

level: high
falsepositives:
  - Probable, rule is Untested.
